shercliff/baseCase/basecase_mhdFoamTimed_strongScaling_640k/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

d 1;            // aspect ratio

md #calc "0 - $d";

vertices
(
    (0 -1 $md)  // 0
    (20 -1 $md) // 1
    (20 1 $md)  // 2
    (0 1 $md)   // 3
    (0 -1 $d)   // 4
    (20 -1 $d)  // 5
    (20 1 $d)   // 6
    (0 1 $d)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 80 40) 
    simpleGrading 
    (1                      // x grading
    (                       // y grading
        (0.5 0.5 5)        // 50% of geometry, 50% of cells, expansion ratio 5
        (0.5 0.5 0.2)       // 50% of geometry, 50% of cells, expansion ratio 0.2
    ) 
    (                       // z grading
        (0.5 0.5 5)	    // 50% of geometry, 50% of cells, expansion ratio 5
        (0.5 0.5 0.2)       // 50% of geometry, 50% of cells, expansion ratio 0.2
    ))
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    frontWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    backWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
